ЦентраАдминистрированияСервер/src/Catalogs/Кластеры/Кластеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры</name>
  <attributes>
    <name>АдминистраторКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресАгентаСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Кластер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортАгентаСервера</name>
    <comment>ПортАгентаСервера Только для &quot;COM&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/Catalogs/Кластеры/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	АдресАгентаСервера = ВРег(АдресАгентаСервера);
	
	ПредставлениеВерсии = "Версия " + Строка(ВерсияПлатформы);
	ПредставлениеАдресаСервера = АдресАгентаСервера;
	ПредставлениеПортаСервера = ПортКластера;
	Наименование = ПредставлениеАдресаСервера + ":" +ПредставлениеПортаСервера 
									+  " (" + ПредставлениеВерсии + ", " + Представление + ")"

КонецПроцедуры
